# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 23
b = "Hello world"
c = [a, b, 23.4]

print(type(a))
print(type(b))
print(type(c))
